clodiuno/hello-world-in-morse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Hello world in morse with clodiuno</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Hello world in morse with clodiuno"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-05 23:05:11 CEST"/>
<meta name="author" content="Antoine R. Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Hello world in morse with clodiuno</h1>

<p>We will now still use the same circuit but this time, we will add a little more fun.
What if we let the led talk in morse.
</p>
<p>
Source: <a href="https://github.com/ardumont/arduino-lab">https://github.com/ardumont/arduino-lab</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Circuit</a></li>
<li><a href="#sec-2">2 Shut up and show us the code</a>
<ul>
<li><a href="#sec-2-1">2.1 Morse DSL</a></li>
<li><a href="#sec-2-2">2.2 orchestration</a></li>
<li><a href="#sec-2-3">2.3 Execution</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Shut up and show us the real thing</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Circuit</h2>
<div class="outline-text-2" id="text-1">

<p>It's the <a href="http://adumont.fr/blog/clodiuno-command-a-led-from-the-repl/">same one as before</a>. That is only one LED on the 13 pin.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Shut up and show us the code</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Morse DSL</h3>
<div class="outline-text-3" id="text-2-1">

<p>it's as simple as a clojure data - map and vectors.
</p>
<p>
A map with a char as the key and the vector of bits as the morse representation.
</p>



<pre class="example">;; 0 represents short signal
;; 1 represents long signal
;; Intermational morse from http://en.wikipedia.org/wiki/Morse_code
(def letters-2-bits {\a [0 1]
                     \b [1 0 0 0]
                     \c [1 0 1 0]
                     \d [1 0 0]
                     \e [0]
                     \f [0 0 1 0]
                     \g [1 1 0]
                     \h [0 0 0 0]
                     \i [0 0]
                     \j [0 1 1 1]
                     \k [1 0 1]
                     \l [0 1 0 0]
                     \m [1 1]
                     \n [1 0]
                     \o [1 1 1]
                     \p [0 1 1 0]
                     \q [1 1 0 1]
                     \r [0 1 0]
                     \s [0 0 0]
                     \t [1]
                     \u [0 0 1]
                     \v [0 0 0 1]
                     \w [0 1 1]
                     \x [1 0 0 1]
                     \y [1 0 1 1]
                     \z [1 1 0 0]})
</pre>


<p>
source: <a href="https://github.com/ardumont/arduino-lab/blob/master/src/arduino_lab/morse.clj">https://github.com/ardumont/arduino-lab/blob/master/src/arduino_lab/morse.clj</a>
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> orchestration</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="example">;; circuit: Just a led on the 13 pin.

;; time
(def short-pulse 100)
(def long-pulse 250)
(def letter-delay 500)

;; pin number
(def pin-led 13)

;; functions

(defn blink
  "Given a board and time, make the led blink a given time"
  [board time]
  (digital-write board pin-led HIGH)
  (Thread/sleep time)
  (digital-write board pin-led LOW)
  (Thread/sleep time))

(defn blink-letter
  "Given a letter, blink according to the sequence of 0 (short pulse) and 1 (long pulse)"
  [board letter]
  (doseq [i letter]
    (if (= i 0)
      (blink board short-pulse)
      (blink board long-pulse)))
  (Thread/sleep letter-delay))

(defn write-morse
  "Given a word, make the led blink in morse for each letter (no upper case, no punctuation)"
  [board word]
  (doseq [l word]
    (blink-letter board (m/letters-2-bits l))))

(defn main-write-morse
  "Given a serial device entry:
- open the board
- make the led blink in morse the word word
- then close the board"
  [board-serial-port word]
  (let [board (arduino :firmata board-serial-port)]
    ;;allow arduino to boot
    (Thread/sleep 5000)
    (pin-mode board pin-led OUTPUT)

    (write-morse board word)

    (close board)))

</pre>


<p>
source: <a href="https://github.com/ardumont/arduino-lab/blob/master/src/arduino_lab/write-morse.clj">https://github.com/ardumont/arduino-lab/blob/master/src/arduino_lab/write-morse.clj</a>
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Execution</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="example">;; define the device according to your env setup (this may vary)
(def device-board "/dev/ttyACM0")

;; this is a limitation on the underlying lib clodiuno uses. Indeed, it searches only for /dev/ttySxx serial devices
;; and on ubuntu GNU/Linux it's named /dev/ACM0
(System/setProperty "gnu.io.rxtx.SerialPorts" device-board)

;; now declaring the board
(def board (arduino :firmata device-board))

;; the led must be set in output mode
(pin-mode board pin-led OUTPUT)

;; Now the heart of the program
(write-morse board "hello world")

;; just to show you that it works (as almost everybody knows at least that sos is 3 short 3 long 3 short)
(write-morse board "sos")

;; do not forget to free the board
(close board)
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Shut up and show us the real thing</h2>
<div class="outline-text-2" id="text-3">

<p><a href="http://youtu.be/wLsJqLDtk9w">http://youtu.be/wLsJqLDtk9w</a>
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-05 23:05:11 CEST</p>
<p class="author">Author: Antoine R. Dumont</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
